app/controllers/user_profiles_controller.rb

  def index
    if params[:id]
      if current_user.role == 'admin'
        @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def list
      @users = User.all
---
SELECT "users".* FROM "users"

  def destroy
    User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]